Revit 2027 API
StructuralSectionAnalysisParams Constructor
 Creates a new instance of StructuralSectionAnalysisParams.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionAnalysisParams()
Public Sub New
public:
StructuralSectionAnalysisParams()
new : unit -> StructuralSectionAnalysisParams
See Also
Reference
StructuralSectionAnalysisParams Class
StructuralSectionAnalysisParams Overload
Autodesk.Revit.DB.Structure.StructuralSections Namespace